DataProcessors/ФСФРИмпортВопросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ФСФРИмпортВопросов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ФСФРБазовыйВопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ФСФРБазовыйВопросы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодВопроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФСФРБазовыйОтветы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ФСФРБазовыйОтветы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодВопроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ФСФРИмпортВопросов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуExcelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл для загрузки";
	ДиалогВыбораФайла.Фильтр    = "(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		
		Возврат; 
		
	КонецЕсли;
	
	ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
	
КонецПроцедуры

&НаКлиенте
//читает данные из файла Excel и помещает их в рекордсет
Функция ПрочитатьФайл()
		
		ВремяНачала=ТекущаяДата();
		Excel = Новый COMОбъект("Excel.Application");
		Workbook      = Excel.Workbooks.Open(ИмяФайла);
		
		//находим нужный лист
		Лист = Неопределено;
		Для i = 1 По Workbook.Sheets.Count() Цикл
			Если Workbook.Sheets.item(i).Name = ИмяЛиста Тогда
				Лист = Workbook.Sheets.item(i);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//если лист не найден, что вобщем-то абсурдно, т.к. мы получили имя из списка листов этой книги, выходим из процедуры
		Если Лист = Неопределено Тогда
			//СУУ_Лог.ЗаписатьСообщение(ИДВызова, "завершение", Неопределено, "НЕ найден указанный лист!");
			Возврат Ложь;
		КонецЕсли;		
		
		//в этом соответствии будем искать имя колонки. т.е. фактически имя поля структуры.
		НомераКолонок = Новый Соответствие;//для поиска имени колонки по номеру
		
		МассивСтрок = Новый Массив; //сюда будем складывать строки таблицы
		
		СтрокаКлючей = "";
		
		xlLastCell = 11;
		
		//RowCount = Excel.ActiveCell.SpecialCells(xlLastCell).Row;//COMОбъект.ActiveCell.CurrentRegion.Rows.Count;//ActiveCell.Row;
		ColumnCount = Excel.ActiveCell.SpecialCells(xlLastCell).Column;//ActiveCell.Column;
		
		Для сч = 1 По ColumnCount Цикл
			
			ИмяКол = СокрЛП(Лист.Cells(1, сч).value);
			ИмяКол = СтрЗаменить(ИмяКол ,")","");
			ИмяКол = СтрЗаменить(ИмяКол ,"(","");
			ИмяКол = СтрЗаменить(ИмяКол ,"/","");
			ИмяКол = СтрЗаменить(ИмяКол ,"\","");
			ИмяКол = СтрЗаменить(ИмяКол ," ","_");
			СтрокаКлючей = СтрокаКлючей + ИмяКол + ",";
			
			Если НЕ ЗначениеЗаполнено(ИмяКол) Тогда
				ИмяКол = "ПустаяКолонка"+Строка(сч);
			КонецЕсли;
			НомераКолонок.Вставить(сч, ИмяКол);
			
		КонецЦикла;
		//убрать последнюю запятую
		СтрокаКлючей = Лев(СтрокаКлючей, СтрДлина(СтрокаКлючей)-1);
		
		//цикл по строкам
		Стр = 2;      //в первой строке - заголовки колонок
		EOF = ЛОЖЬ;
		Пока НЕ EOF Цикл
			
			//проверка конца файла. признак - 10 пустых строк подряд. проверяем по первой колонке
			Если НЕ ЗначениеЗаполнено(Лист.Cells(Стр, 1).value) Тогда
				ЕстьЗначение = Ложь;
				Для сч = 1 по 9 Цикл
					Если ЗначениеЗаполнено(Лист.Cells(Стр+сч, 1).value) Тогда
						ЕстьЗначение = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НЕ ЕстьЗначение Тогда
					EOF = Истина;
					Прервать;//выходим из цикла по строкам файла эксель
				КонецЕсли;
			КонецЕсли;
			
			//НовСтр = ТЗРекордсет.Добавить();
			
			//аналог строки таблицы
			СтруктураСтроки = Новый Структура(СтрокаКлючей);
			
			//цикл по колонкам
			Для Кол = 1 По ColumnCount Цикл
				
				ИмяКолоки = НомераКолонок.Получить(Кол);//соответствие
				
				СтруктураСтроки.Вставить(ИмяКолоки, Лист.Cells(Стр, Кол).value);
				
			КонецЦикла;
			
			МассивСтрок.Добавить(СтруктураСтроки);
			
			Стр = Стр + 1;
			
		КонецЦикла;
		
		Excel.Quit();
		Excel = 0;
		
		
		Возврат МассивСтрок;
		
	
КонецФункции

//загрузка вопросов
&НаСервере
Процедура ЗагрузитьНаСервере(МассивСтрок)
	
	
	//Пример вопроса:
	//--==Код вопроса: 14.1.107
	//К средним (averages) арифметическим и геометрическим невзвешенным относятся: 
	//I. Value Line 
	//II. DJIA
	//III.	Nikkei225
	//IV.	S&P500
	//V.	DAX
	// Ответы:
	//A.	Только I, II, III
	//B.	Только IV, V
	//C.	Только II, III
	//D.	Все
	
	//алгоритм
	
	//все, что находится между строками 
	
	//--==Код вопроса: 14.1.107
	//...
	// Ответы:
	
	//является вопросом и помещается в регистр ФСФРБазовый
	
	//строки после "Ответы:" помещаются в регистр ФСФРБазовыйОтветы
	//
	
	сч=0; //счетчик строк массива
	
	Пока сч<=МассивСтрок.Количество() Цикл
		
		Стр = МассивСтрок[сч];
		т1 = ВРег(СокрЛП(Стр["ColA"]));
		
		Если Найти(т1, "КОД ВОПРОСА")>0 Тогда
			
			//получаем номер вопроса
			п = Найти(т1, ":");
			КодВопроса = СокрЛП(Прав(т1, СтрДлина(т1)-п)); //КодВопроса = "14.2.7"
			
			сч=сч+1;
			
			//ищем строку "Ответы" и пока ее не нашли собираем текст вопроса
			
			ТекстВопроса = МассивСтрок[сч]["ColA"]+Символы.ПС;
			
			сч=сч+1;
			
			Пока 1=1 Цикл
				Стр = МассивСтрок[сч];
				
				
				Если Найти(ВРег(СокрЛП(Стр["ColA"])), "ОТВЕТЫ:")>0 Тогда
					Прервать;
				КонецЕсли;
				
				ТекстВопроса=ТекстВопроса+СокрЛП(Стр["ColA"])+Символы.ПС;
				
				сч=сч+1;
			КонецЦикла;
			
			
			//создаем вопрос
			НаборЗаписейВ = РегистрыСведений.ФСФРБазовыйВопросы.СоздатьНаборЗаписей(); 
			НаборЗаписейВ.Отбор.кодВопроса.Установить(КодВопроса);
			НоваяЗапись = НаборЗаписейВ.Добавить();
			НоваяЗапись.КодВопроса = КодВопроса;
			НоваяЗапись.Вопрос = ТекстВопроса;
			НаборЗаписейВ.Записать();
			
			//добавляем ответы
			сч=сч+1;
			
			Пока 1=1 Цикл
				Попытка
					Стр = МассивСтрок[сч];
				Исключение
					//для отладки. сюда попадем в конце файла.
					а=12;  Возврат;
				КонецПопытки;
				
				т1 = СокрЛП(Стр["ColA"]);
				
				//если дошли до пустой строки - выходим из цикла, т.к. это конец списка ответов к данному вопросу
				Если НЕ ЗначениеЗаполнено(т1) или т1 = "" Тогда
					Прервать;
				КонецЕсли;
					
				//добавляем ответ
				
				//уберем плюс, если есть
				й = СтрЗаменить(т1,"+","");
				й = СтрЗаменить(й,".","");				
				НаборЗаписей = РегистрыСведений.ФСФРБазовыйОтветы.СоздатьНаборЗаписей(); 
				НаборЗаписей.Отбор.кодВопроса.Установить(КодВопроса);
				НаборЗаписей.Отбор.НомерВарианта.Установить(й);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.КодВопроса = КодВопроса;
				НоваяЗапись.НомерВарианта = й;                      	//A.
				НоваяЗапись.ВариантОтвета = МассивСтрок[сч]["ColB"];   	//I или II.
				НаборЗаписей.Записать();
				
				сч=сч+1;
			КонецЦикла;
			
		КонецЕсли;
		
		
		сч=сч+1;
		
			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	М = ПрочитатьФайл();
	ЗагрузитьНаСервере(М);
КонецПроцедуры

//загрузка правильных ответов

&НаСервере
Процедура ЗагрузитьПравильныеОтветыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравильныеОтветы(Команда)
	ЗагрузитьПравильныеОтветыНаСервере();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РимскоеЧисло(Й)
	
	Если Й=1 ИЛИ Й="1" Тогда
		Ж = "I";
	ИначеЕсли Й=2 ИЛИ Й="2" Тогда
		Ж = "II";
	ИначеЕсли Й=3 ИЛИ Й="3" Тогда
		Ж = "III";
	ИначеЕсли Й=4 ИЛИ Й="4" Тогда
		Ж = "IV";
	ИначеЕсли Й=5 ИЛИ Й="5" Тогда
		Ж = "V";
	ИначеЕсли Й=6 ИЛИ Й="6" Тогда
		Ж = "VI";
	ИначеЕсли Й=7 ИЛИ Й="7" Тогда
		Ж = "VII";
	ИначеЕсли Й=8 ИЛИ Й="8" Тогда
		Ж = "VIII";
	ИначеЕсли Й=9 ИЛИ Й="9" Тогда
		Ж = "IX";
	ИначеЕсли Й=10 ИЛИ Й="10" Тогда
		Ж = "X";
	ИначеЕсли Й=11 ИЛИ Й="11" Тогда
		Ж = "XI";
	ИначеЕсли Й=12 ИЛИ Й="12" Тогда
		Ж = "XII";
	ИначеЕсли Й=13 ИЛИ Й="13" Тогда
		Ж = "XIII";
	ИначеЕсли Й=14 ИЛИ Й="14" Тогда
		Ж = "XIV";
	ИначеЕсли Й=15 ИЛИ Й="15" Тогда
		Ж = "XV";
	ИначеЕсли Й=16 ИЛИ Й="16" Тогда
		Ж = "XVI";
	ИначеЕсли Й=17 ИЛИ Й="17" Тогда
		Ж = "XVII";
	ИначеЕсли Й=18 ИЛИ Й="18" Тогда
		Ж = "XVIII";
	ИначеЕсли Й=19 ИЛИ Й="19" Тогда
		Ж = "IX";
	ИначеЕсли Й=20 ИЛИ Й="20" Тогда
		Ж = "XX";
	КонецЕсли;
	
	Возврат  Ж;
КонецФункции


&НаКлиенте
Процедура СоздатьFB2(Команда)
	Т = СоздатьFB2_Сервер();
	Т.Записать("d:\fsfr\fb2\ФСФРБазовый.fb2");
КонецПроцедуры
 
&НаСервере
Функция СоздатьFB2_Сервер()
	
	Т = Новый ТекстовыйДокумент;
	Т.ДобавитьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?>");
	
	Т.ДобавитьСтроку("<FictionBook xmlns=""http://www.gribuser.ru/xml/fictionbook/2.0"" xmlns:xlink=""http://www.w3.org/1999/xlink"">");
	//Т.ДобавитьСтроку("");
	//Т.ДобавитьСтроку("");
	//Т.ДобавитьСтроку("");
	Т.ДобавитьСтроку("
	  |
	  |<description>
	  |      <title-info>
	  |          <genre>antique</genre>
	  |              <author><first-name></first-name><last-name>user</last-name></author>
	  |          <book-title>ФСФР базовый экзамен</book-title>
	  |          
	  |          <lang>en</lang>
	  |          
	  |          
	  |      </title-info>
	  |      <document-info>
	  |          <author><first-name></first-name><last-name>user</last-name></author>
	  |          <program-used>1С 8.3</program-used>
	  |          <date>17.9.2016</date>
	  |          <id>2cb12cfa-99f5-454f-bb1f-1c17bd7db56f</id>
	  |          <version>1.0</version>
	  |      </document-info>
	  |      <publish-info>
	  |          
	  |          
	  |          
	  |      </publish-info>
	  |  </description>
	|<body>
	|<section>	
	|");

	//тут будет текст
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФСФРБазовыйВопросы.КодВопроса КАК КодВопроса,
		|	ФСФРБазовыйВопросы.Вопрос
		|ИЗ
		|	РегистрСведений.ФСФРБазовыйВопросы КАК ФСФРБазовыйВопросы
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодВопроса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФСФРБазовыйОтветы.НомерВарианта,
		|	ФСФРБазовыйОтветы.ВариантОтвета
		|ИЗ
		|	РегистрСведений.ФСФРБазовыйОтветы КАК ФСФРБазовыйОтветы
		|ГДЕ
		|	ФСФРБазовыйОтветы.КодВопроса = &КодВопроса";
	
	
	Пока Выборка.Следующий() Цикл
		
		Т.ДобавитьСтроку("<p>--==Код вопроса: "+Выборка.КодВопроса+"</p>");

		й = СтрЗаменить(Выборка.Вопрос, Символы.ПС, "</p><p>");
		Т.ДобавитьСтроку("<p>"+й+"</p>");

		Т.ДобавитьСтроку("<p>Ответы:</p>");
		
		Запрос.УстановитьПараметр("КодВопроса", Выборка.КодВопроса);
		Рез = Запрос.Выполнить();
		ВыборкаОтветы = Рез.Выбрать();
		Пока ВыборкаОтветы.Следующий() Цикл
			Т.ДобавитьСтроку("<p>"+ВыборкаОтветы.НомерВарианта+"."+Символы.Таб+ВыборкаОтветы.ВариантОтвета+"</p>");
		КонецЦикла;

	КонецЦикла;
	
	
	
	
	//Т.ДобавитьСтроку("");
	//Т.ДобавитьСтроку("");
	
	Т.ДобавитьСтроку("</section>");
	Т.ДобавитьСтроку("</body>");
	
	
	Т.ДобавитьСтроку("</FictionBook>");
	Возврат Т;
	
КонецФункции
